let A = parseFloat(prompt("(Будуємо трикутник) Вкажіть довжину сторони A"));
let B = parseFloat(prompt("(Будуємо трикутник) Вкажіть довжину сторони B"));
let C = parseFloat(prompt("(Будуємо трикутник) Вкажіть довжину сторони C"));
// Перевірка на коректне введення довжин.
if (isNaN(A) || isNaN(B) || isNaN(C)) {
  console.log("Введіть будь ласка числове значення!!!");
}
// Формула Герона, розрахунок площі.
let p = (A + B + C) / 2;
let S = (p * (p - A) * (p - B) * (p - C)) ** (1 / 2);
console.log(parseFloat(S.toFixed(3)));
// Теорема Піфагора, перевірка чи трикутник є прямокутним.
if (
  A ** 2 == B ** 2 + C ** 2 ||
  B ** 2 == A ** 2 + C ** 2 ||
  C ** 2 == A ** 2 + B ** 2
) {
  console.log("Трикутник є прямокутним");
} else {
  console.log("Трикутник не є прямокутним");
}
